podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/UART2_MKL17Z4_C7816.svd.xml
            <register>
               <name>IS7816</name>
               <description>7816 Interrupt Status Register</description>
               <addressOffset>0x1A</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXT</name>
                     <description>Receive Threshold Exceeded Interrupt\n
Set if the number of consecutive NACKS generated as a result of parity errors and buffer overruns is &gt;= the value in ET7816[RXTHRESHOLD]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Negated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Asserted/Write 1 to clear</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RXT" > <name>TXT</name> <description>Transmit Threshold Exceeded Interrupt\n
Set if the number of retries and corresponding NACKS &gt; the value in the ET7816[TXTHRESHOLD] field</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>GTV</name> <description>Guard Timer Violated Interrupt\n
Set if a guard time (GT, CGT or BGT) has been violated</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>ADT</name> <description>ATR Duration Time Interrupt\n
Indicates that the ATR duration time, the time between the leading edge of the TS character being
received and the leading edge of the next response character, has exceeded the programmed value</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>INITD</name> <description>Initial Character Detected Interrupt\n
Set when a valid initial character has been received</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>BWT</name> <description>Block Wait Timer Interrupt\n
Set when the Block Wait Time (BWT) has been violated</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>CWT</name> <description>Character Wait Timer Interrupt\n
Set when the Character Wait Time (CWT) has been violated</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>WT</name> <description>Wait Timer Interrupt\n
Set when the Wait Time (WT) has been violated</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>WP7816</name>
               <description>7816 Wait Parameter Register</description>
               <addressOffset>0x1B</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WTX</name>
                     <description>Wait Time Multiplier (C7816[TTYPE] = 1)</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WN7816</name>
               <description>7816 Wait N Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GTN</name>
                     <description>Guard Band N</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WF7816</name>
               <description>7816 Wait FD Register</description>
               <addressOffset>0x1D</addressOffset>
               <size>8</size>
               <resetValue>0x1</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GTFD</name>
                     <description>FD Multiplier</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>ET7816</name>
               <description>7816 Error Threshold Register</description>
               <addressOffset>0x1E</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXTHRESHOLD</name>
                     <description>Receive NACK Threshold\n
The value written to this field indicates the maximum number of consecutive NACKs generated as a result
of a parity error or receiver buffer overruns before the host processor is notified</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXTHRESHOLD</name>
                     <description>Transmit NACK Threshold\n
The value written to this field indicates the maximum number of failed attempts (NACKs) a transmitted
character can have before the host processor is notified</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TL7816</name>
               <description>7816 Transmit Length Register</description>
               <addressOffset>0x1F</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>TLEN</name>
                     <description>Transmit Length</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>AP7816A_T0</name>
               <description>7816 ATR Duration Timer Register A</description>
               <addressOffset>0x3A</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>ADTI_H</name>
                     <description>ATR Duration Time Integer High (C7816[TTYPE] = 0)</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>AP7816B_T0</name>
               <description>7816 ATR Duration Timer Register B</description>
               <addressOffset>0x3B</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>ADTI_L</name>
                     <description>ATR Duration Time Integer Low (C7816[TTYPE] = 0)</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WP7816A_T0</name>
               <description>7816 Wait Parameter Register A</description>
               <addressOffset>0x3C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WI_H</name>
                     <description>Wait Time Integer High (C7816[TTYPE] = 0)</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WP7816A_T1</name>
               <description>7816 Wait Parameter Register A</description>
               <addressOffset>0x3C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>BWI_H</name>
                     <description>Block Wait Time Integer High (C7816[TTYPE] = 1)</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WP7816B_T0</name>
               <description>7816 Wait Parameter Register B</description>
               <addressOffset>0x3D</addressOffset>
               <size>8</size>
               <resetValue>0x14</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WI_L</name>
                     <description>Wait Time Integer Low (C7816[TTYPE] = 0)</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WP7816B_T1</name>
               <description>7816 Wait Parameter Register B</description>
               <addressOffset>0x3D</addressOffset>
               <size>8</size>
               <resetValue>0x14</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>BWI_L</name>
                     <description>Block Wait Time Integer Low (C7816[TTYPE] = 1)</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WGP7816_T1</name>
               <description>7816 Wait and Guard Parameter Register</description>
               <addressOffset>0x3E</addressOffset>
               <size>8</size>
               <resetValue>0x6</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>BGI</name>
                     <description>Block Guard Time Integer (C7816[TTYPE] = 1)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CWI1</name>
                     <description>Character Wait Time Integer 1 (C7816[TTYPE] = 1)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WP7816C_T1</name>
               <description>7816 Wait Parameter Register C</description>
               <addressOffset>0x3F</addressOffset>
               <size>8</size>
               <resetValue>0xB</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CWI2</name>
                     <description>Character Wait Time Integer 2 (C7816[TTYPE] = 1)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
